

// window არის ბრაუზერის მთავარი ობიექტი.
// JavaScript-ში ყველაფერი ბრაუზერში window ობიექტის შიგნით მუშაობს
// var
// let
// const
// var ძველი მეთოდია
// შეიძლება თავიდან გამოცხადდეს
// არ აქვს block scope
// let გამოიყენება ისეთი ცვლადისთვის
// რომლის მნიშვნელობაც მომავალში შეიცვლება
// const გამოიყენება ისეთი ცვლადისთვის
// რომლის მნიშვნელობაც აღარ უნდა შეიცვალოს
// ამის გამო კოდში ხშირად ჩნდება შეცდომები
// იმიტომ რომ ძველი საიტები და პროგრამები გაფუჭდებოდა
// მილიონობით პროექტი იყენებდა var-ს
// ამიტომ JavaScript-მა დატოვა backward compatibility
// Increment ნიშნავს 1-ით გაზრდას
// გამოიყენება ++
// Decrement ნიშნავს 1-ით შემცირებას
// გამოიყენება --

let name = "Nika";

console.log(typeof name);

// String literal გამოიყენება ტექსტში ცვლადის მარტივად ჩასასმელად.
// ამისთვის ვიყენებთ backtick-ებ

let age = 15;

console.log(`I am ${age} years old.`);