def multiply_numbers():
    num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
    num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))
    return num1 * num2


# ფუნქციის გამოძახება
result = multiply_numbers()

# შედეგის დაბეჭდვა
print(result)




# print გამოიყენება იმისთვის, რომ ინფორმაცია ეკრანზე გამოიტანოს.
# ის უბრალოდ აჩვენებს შედეგს, მაგრამ ფუნქციიდან მნიშვნელობას არ აბრუნებს.
#
# return კი ფუნქციის მთავარი "გამომტანია" — ის აბრუნებს მნიშვნელობას ფუნქციიდან
# და ამ მნიშვნელობის შენახვა შესაძლებელია ცვლადში.
#
# return-ის მუშაობის პრინციპი:
# 1) როდესაც return შესრულდება, ფუნქცია მაშინვე ჩერდება.
# 2) return-ის შემდეგ დაწერილი კოდი აღარ შესრულდება.
