# კომენტარი არის ტექსტი კოდშიი რომელსაც პროგრამა არ ასრულებს ის მხოლოდ განმარტებისტვის ან შენიშვნისთვის გამოიყენება
# ქეის სენსიტიურობა იშნავს რომ პროგრამირების ენაში დიდი და პატარა ასოები განსხვავებულად აღიქმება მაგალითად Name და name  ეს ორი ცვლადი სხვადასხვაა
age=15
Age=20
print(age)
print(Age)


# snake_case არის წერის სტილი, სადაც სიტყვები გამოყოფილია ქვედა ტირით (_)
# მაგალითად: my_variable_name
# ამ სტილი ხშირად გამოიყენება Python-ში ცვლადების დასარქმევად

first_name = "Nika"
last_name = "Veliadze"
user_age = 16


# Debugging (დაბგინგი) არის კოდში შეცდომების პოვნა და მათი გამოსწორება.
# როცა პროგრამა არ მუშაობს სწორად, პროგრამისტი იყენებს debugging-ს,
# რომ გაარკვიოს სად არის პრობლემა და შეასწოროს ის.



# არასწორია
# print("Hello World)
# city = "London"
# pritn(City)

# სწორია
print("Hello World")
city = "London"
print(city)