# Sequencing - კოდი სრულდება რიგრიგობით
# print("პირველი ნაბიჯი")   # ეს შესრულდება პირველ რიგში
# print("მეორე ნაბიჯი")    # ეს შესრულდება შემდეგ
# print("მესამე ნაბიჯი")   # ბოლოს შესრულდება ეს
   


# Iteration - while ციკლი იმეორებს ბლოკს მანამ, სანამ პირობა ჭეშმარიტია
# count = 1
# while count <= 5:
#     print("რიცხვი:", count)  გამეორდება 5-ჯერ
#     count += 1   ყოველ ჯერზე გაიზრდება count 1-ით



# Selection - არჩევა პირობის მიხედვით
# age = int(input("შეიყვანეთ ასაკი: "))

# if age >= 18:
#     print("შენ სრულწლოვანი ხარ.")   შესრულდება, თუ პირობა მართალია
# else:
#     print("შენ არასრულწლოვანი ხარ.")   შესრულდება, თუ პირობა მცდარია








# ნაბიჯი 1: შემოიტანე პირველი რიცხვი
# a = int(input("შეიყვანე პირველი რიცხვი: "))

# # ნაბიჯი 2: შემოიტანე მეორე რიცხვი
# b = int(input("შეიყვანე მეორე რიცხვი: "))

# ნაბიჯი 3: დაითვალე ჯამი
# sum = a + b

# ნაბიჯი 4: გამოიტანე შედეგი ეკრანზე
# print("ორივე რიცხვის ჯამი არის:", sum)
   


# ალგორითმი: ორი რიცხვის ჯამის პოვნა

# ნაბიჯი 1: შეიყვანე პირველი რიცხვი  
# ნაბიჯი 2: შეიყვანე მეორე რიცხვი  
# ნაბიჯი 3: დაამატე ისინი  
# ნაბიჯი 4: გამოიტანე შედეგი ეკრანზე
 



# მომხმარებლისგან ვიღებთ სახელს
name = input("შეიყვანე შენი სახელი: ")

# ვადარებთ ჩვენს სახელს (მაგალითად, ჩემი სახელია 'Nika')
if name == "Nika":
    # თუ სახელები ემთხვევა
    print(True)
else:
    # თუ არ ემთხვევა
    print(False)

    